## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [ ]:
#!pip install sqlalchemy==1.3.9
#!pip install sqlserver
#!pip install ipython-sql

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [1]:
%load_ext sql

In [2]:
import pyodbc 
%sql mssql+pyodbc://LAPTOP-TLS8KKFO/Spacex?driver=ODBC+Driver+17+for+SQL+Server?TrustedConnection=yes



**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"*




##### Display the names of the unique launch sites  in the space mission

In [11]:
%sql SELECT DISTINCT (LAUNCH_SITE) FROM Spacex

 * mssql+pyodbc://LAPTOP-TLS8KKFO/Spacex?driver=ODBC Driver 17 for SQL Server
Done.

[('CCAFS LC-40',), ('CCAFS SLC-40',), ('KSC LC-39A',), ('VAFB SLC-4E',)]


#####  Display 5 records where launch sites begin with the string 'CCA'

In [23]:
%%sql 
SELECT TOP 5 * 
FROM Spacex 
WHERE Launch_Site LIKE 'CCA%'

 * mssql+pyodbc://LAPTOP-TLS8KKFO/Spacex?driver=ODBC Driver 17 for SQL Server
Done.

[(datetime.date(2010, 6, 4), datetime.time(18, 45), 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 (datetime.date(2010, 12, 8), datetime.time(15, 43), 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 (datetime.date(2012, 5, 22), datetime.time(7, 44), 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 (datetime.date(2012, 10, 8), datetime.time(0, 35), 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 (datetime.date(2013, 3, 1), datetime.time(15, 10), 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]


##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [27]:
%%sql

SELECT SUM(PAYLOAD_MASS_KG) AS Total_Payload_NASACRS
FROM Spacex
WHERE Customer = 'NASA (CRS)'

 * mssql+pyodbc://LAPTOP-TLS8KKFO/Spacex?driver=ODBC Driver 17 for SQL Server
Done.

[(45596,)]


##### Display average payload mass carried by booster version F9 v1.1

In [29]:
%%sql

SELECT AVG(PAYLOAD_MASS_KG) AS AVG_Payload_F9v11
FROM Spacex
WHERE Booster_Version = 'F9 v1.1'

 * mssql+pyodbc://LAPTOP-TLS8KKFO/Spacex?driver=ODBC Driver 17 for SQL Server
Done.

[(2928,)]


##### List the date when the first succesful landing outcome in ground pad was acheived.

In [47]:
%%sql

SELECT MIN(Date) AS Date_first_Sucfl_Lndng
FROM Spacex
WHERE Landing_Outcome = 'Success (Ground pad)'

 * mssql+pyodbc://LAPTOP-TLS8KKFO/Spacex?driver=ODBC Driver 17 for SQL Server
Done.

[(datetime.date(2015, 12, 22),)]


##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [54]:
%%sql

SELECT Booster_Version, PAYLOAD_MASS_KG, Landing_Outcome
FROM Spacex
WHERE Landing_Outcome = 'Success (Drone ship)' AND (PAYLOAD_MASS_KG BETWEEN 4000 AND 6000)

 * mssql+pyodbc://LAPTOP-TLS8KKFO/Spacex?driver=ODBC Driver 17 for SQL Server
Done.

[('F9 FT B1022', 4696, 'Success (drone ship)'),
 ('F9 FT B1026', 4600, 'Success (drone ship)'),
 ('F9 FT  B1021.2', 5300, 'Success (drone ship)'),
 ('F9 FT  B1031.2', 5200, 'Success (drone ship)')]


##### List the total number of successful and failure mission outcomes

In [81]:
%%sql 

SELECT Mission_Outcome, COUNT(Mission_Outcome) AS COUNT
FROM Spacex 
WHERE Mission_Outcome = 'Success' OR Mission_Outcome = 'Failure (in flight)'
GROUP BY Mission_Outcome

 * mssql+pyodbc://LAPTOP-TLS8KKFO/Spacex?driver=ODBC Driver 17 for SQL Server
Done.

[('Failure (in flight)', 1), ('Success', 99)]


##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [72]:
%%sql

SELECT Booster_Version, PAYLOAD_MASS_KG AS Max_Payload_Mass
FROM Spacex
WHERE PAYLOAD_MASS_KG = (SELECT MAX(PAYLOAD_MASS_KG) FROM Spacex)

 * mssql+pyodbc://LAPTOP-TLS8KKFO/Spacex?driver=ODBC Driver 17 for SQL Server
Done.

[('F9 B5 B1048.4', 15600),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1060.2 ', 15600),
 ('F9 B5 B1058.3 ', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1060.3', 15600),
 ('F9 B5 B1049.7 ', 15600)]


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

In [114]:
%%sql

SELECT MONTH(Date) AS Month, Landing_Outcome AS Failed_Landing_Outcomes, Booster_Version, Launch_Site
FROM Spacex
WHERE Landing_Outcome = 'Failure (Drone Ship)' AND (DATE LIKE '2015%')

 * mssql+pyodbc://LAPTOP-TLS8KKFO/Spacex?driver=ODBC Driver 17 for SQL Server
Done.

[(1, 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 (4, 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]


##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [110]:
%%sql

SELECT Landing_Outcome, COUNT(Landing_Outcome) AS Count
FROM Spacex
WHERE Date BETWEEN '2010-06-04' AND '2017-03-20'
GROUP BY Landing_Outcome
ORDER BY Count DESC

 * mssql+pyodbc://LAPTOP-TLS8KKFO/Spacex?driver=ODBC Driver 17 for SQL Server
Done.

[('No attempt', 10),
 ('Failure (drone ship)', 5),
 ('Success (drone ship)', 5),
 ('Success (ground pad)', 3),
 ('Controlled (ocean)', 3),
 ('Uncontrolled (ocean)', 2),
 ('Failure (parachute)', 2),
 ('Precluded (drone ship)', 1)]